
&НаКлиенте
Процедура Подсчитать(Команда)
	
	СловаТекста = ВРег (Текст);
    РазделениеТекста = СтрРазделить (СловаТекста, " .,-?!" + Символы.ПС, Ложь);
    	
	УникальныеСлова = Новый Соответствие;
	
	Для Каждого Слово Из РазделениеТекста Цикл 
		
		//Повтор = УникальныеСлова.Получить(Слово);
		//		
		//Если Повтор = Неопределено Тогда
		УникальныеСлова.Вставить(Слово,1);
		//Иначе
		//НовоеЗначение = Повтор + 1;
		//УникальныеСлова.Вставить(Слово,НовоеЗначение);
		//КонецЕсли;
			 
	КонецЦикла; 
		
        Сообщить(СтрШаблон("Количество уникальных слов:%1",УникальныеСлова.Количество()));
		
КонецПроцедуры
