
&НаКлиенте
Процедура Вычесть(Команда)
	
	Результат = Результат - Значение;
	
КонецПроцедуры

&НаКлиенте
Процедура Разделить(Команда)
	
	Результат = Результат / Значение;
	
КонецПроцедуры

&НаКлиенте
Процедура Сложить(Команда)
	
	Результат = Результат + Значение;
	
КонецПроцедуры

&НаКлиенте
Процедура Умножить(Команда)
	
	Результат = Результат * Значение;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьРезультатКПамяти(Команда)
	
	Память = Значение + Память;
	
КонецПроцедуры

&НаКлиенте
Процедура ВычестьРезультатИзПамяти(Команда)
	
	Память = Память - Значение;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбменятьЗначениеРезультат(Команда)
	
	Временная = Значение;
	Значение = Результат;
	Результат = Временная;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьПамять(Команда)
	
	Память = 0;
	
КонецПроцедуры

&НаКлиенте
Процедура ПамятьВЗначение(Команда)
	
	Значение = Память;
	
КонецПроцедуры
