
Функция СотрудникиВызовСервера() Экспорт
	
	Возврат СотрудникиСервер.ДеньРожденияТекущегоПользователя();
	
КонецФункции

Процедура ДеньРождения() Экспорт  
	
	ДеньРождения = День(ПараметрыСеанса.СотрудникТекущегоПользователя.ДатаРождения);
	МесяцРождения = Месяц(ПараметрыСеанса.СотрудникТекущегоПользователя.ДатаРождения);
	
	Если  День(ТекущаяДата()) = ДеньРождения И Месяц(ТекущаяДата()) = МесяцРождения Тогда
		Сообщить ("Поздравляем с днем рождения!");
		
	КонецЕсли; 
	
КонецПроцедуры