
Процедура ПриНачалеРаботыСистемы() Экспорт  
		 
	ДатаСегодня = ТекущаяДата();
	ДатаСегодняДеньНеделиПропись = Формат(ДатаСегодня,"ДФ=дддд");
	ДатаСегодняДеньНедели = ДеньНедели(ДатаСегодня);
	НачалоРабочегоДня = НачалоДня(ДатаСегодня) + 32400;   // 9
	КонецРабочегоДня = НачалоДня(ДатаСегодня) + 64800;     // 18
	БуднийДень = ДатаСегодняДеньНедели = 5 ИЛИ ДатаСегодняДеньНедели = 4 ИЛИ ДатаСегодняДеньНедели = 3 ИЛИ ДатаСегодняДеньНедели = 2 ИЛИ ДатаСегодняДеньНедели =1;
	Если БуднийДень Тогда
		Сообщение = ("будний день.Рабочее время");
		
		Если ДатаСегодня < НачалоРабочегоДня Тогда
			СообщениеОВремени = ("ещё не началось");
		ИначеЕсли ДатаСегодня > КонецРабочегоДня Тогда
			СообщениеОВремени = ("завершилось");
		Иначе
			СообщениеОВремени = ("идёт"); 
		КонецЕсли;
		
	Иначе
		СообщениеОВремени = ("выходной день");
	КонецЕсли;
	
	ТекстСообщения = СтрШаблон ("Сегодня %1, %2, %3.", ДатаСегодняДеньНеделиПропись, Сообщение, СообщениеОВремени);
	Сообщить(ТекстСообщения);	
		 
КонецПроцедуры
	 