
Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка) 
	
	Поля.Добавить("УдалитьЮридическийАдрес");
	Поля.Добавить("УдалитьПочтовыйАдрес");
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Представление = СтрШаблон("%1-%2", Данные.УдалитьЮридическийАдрес, Данные.УдалитьПочтовыйАдрес); 
	
КонецПроцедуры 

Процедура ЗаполнитьТабличнуюЧастьКонтактнаяИнформация() Экспорт

	Выборка = Справочники.Контрагенты.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		КонтрагентОбъект = Выборка.ПолучитьОбъект();
		Строка = КонтрагентОбъект.КонтактнаяИнформация.Добавить();
		Строка.Вид = Справочники.ВидыКонтактнойИнформации.ПочтовыйАдресКонтрагента;
		Строка.Значение = КонтрагентОбъект.УдалитьПочтовыйАдрес;
		
		Строка = КонтрагентОбъект.КонтактнаяИнформация.Добавить();
		Строка.Вид = Справочники.ВидыКонтактнойИнформации.ЮридическийАдресКонтрагента;
		Строка.Значение = КонтрагентОбъект.УдалитьЮридическийАдрес;	
			
		КонтрагентОбъект.Записать();
	КонецЦикла;
	 
	
КонецПроцедуры

