
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо;
	
КонецПроцедуры  
 
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты) 
	 
	Если ЮридическоеФизическоеЛицо = ПредопределенноеЗначение("Перечисление.ЮридическоеФизическоеЛицо.ЮридическоеЛицо") Тогда
		
		Если СтрДлина (ИНН) <> 10 Тогда
			Сообщить("ИНН Юридического лица должен состоять из 10 цифр");
			Отказ = Истина;
		КонецЕсли;
		
		ПравильныйИНН = РаботаСИНН.ИННВерен(ИНН);
		
		Если Не ПравильныйИНН Тогда
			Отказ = Истина;
			Сообщить("ИНН не верен");
		КонецЕсли;
		
		Если СтрДлина (КПП) <> 9 Тогда
			Сообщить("КПП состоит из 9 цифр");
			Отказ = Истина;
		КонецЕсли;
		
	ИначеЕсли ЮридическоеФизическоеЛицо = ПредопределенноеЗначение("Перечисление.ЮридическоеФизическоеЛицо.ФизическоеЛицо") Тогда 
		
		Если СтрДлина (ИНН) <> 12 Тогда
			Сообщить("ИНН Физического лица должен состоять из 12 цифр");
			Отказ = Истина;
		КонецЕсли;
		
		Если СтрДлина (КПП) > 0 Тогда
			Сообщить("КПП Физического лица должно быть пустое");
			Отказ = Истина;
		КонецЕсли; 
	КонецЕсли;
	
	
	ДлинаСтроки = СтрДлина(ИНН);
	Для Счетчик = 1 По ДлинаСтроки Цикл
		СимволСтроки = Сред(ИНН, Счетчик, 1);
		КодСиволаСтроки = КодСимвола(СимволСтроки);
		Если КодСиволаСтроки < 48 Или КодСиволаСтроки >57 Тогда 
			Сообщить("ИНН может состоять только из цифр.");
			Отказ = Истина;
		КонецЕсли;	
		
	КонецЦикла;   
	
	ДлинаСтроки = СтрДлина(КПП);
	Для Счетчик = 1 По ДлинаСтроки Цикл
		СимволСтроки = Сред(КПП, Счетчик, 1);
		КодСиволаСтроки = КодСимвола(СимволСтроки);
		Если (КодСиволаСтроки < 48 Или КодСиволаСтроки >57) и ЮридическоеФизическоеЛицо = ПредопределенноеЗначение("Перечисление.ЮридическоеФизическоеЛицо.ЮридическоеЛицо") Тогда 
			Сообщить("КПП может состоять только из цифр.");
			Отказ = Истина;
		КонецЕсли;							
		
	КонецЦикла;
					
КонецПроцедуры   



