
&НаКлиенте
Процедура Сохранить(Команда)
	
	Приглашение = Объект.Имя + Объект.ЧтоЕст + Объект.ЧтоПьёт + Объект.БудетСНочёвкой;
	
	Если Объект.БудетСНочёвкой = Истина Тогда
		Ночёвка = ("Нужна кровать")
	Иначе 
		Ночёвка = ("Кровать не нужна");
	КонецЕсли; 
	
	Сообщить(СтрШаблон("Придет: %1 Будет есть: %2 Будет пить: %3", Объект.Имя, Объект.ЧтоЕст, Объект.ЧтоПьёт));
	//Сообщить(СтрШаблон("Придет: %1", Объект.Имя));
	//Сообщить(СтрШаблон("Будет есть: %1", Объект.ЧтоЕст));
	//Сообщить(СтрШаблон("Будет пить: %1", Объект.ЧтоПьёт));
	Сообщить(Ночёвка);
	
КонецПроцедуры
