
&НаКлиенте
Процедура НайтиСлова(Команда)
	
	СловаТекста = СтрРазделить(Текст, " .,-?!" + Символы.ПС, Ложь);
	
	СамоеДлиноеСлово = Неопределено;
	СамоеКороткоеСлово = Неопределено;
	
	Для Каждого Слово Из СловаТекста Цикл
		
		Если СамоеДлиноеСлово = Неопределено
			Или СтрДлина(СамоеДлиноеСлово) < СтрДлина(Слово) Тогда
			
			СамоеДлиноеСлово = Слово;
		КонецЕсли; 
					
		Если СамоеКороткоеСлово = Неопределено
			Или СтрДлина(СамоеКороткоеСлово) > СтрДлина(Слово) Тогда
			
			СамоеКороткоеСлово = Слово;
		КонецЕсли;
		
	КонецЦикла;
	
	Сообщить(СтрШаблон("Самое длиное слово: %1. Самое короткое слово: %2.", СамоеДлиноеСлово, СамоеКороткоеСлово));  
	
КонецПроцедуры
