
&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	
	Объект.ПолноеНаименование = Объект.Наименование;
	
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе",Ложь);
	ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора",ПараметрыФормы,Элементы.Программы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПрограммыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	//Для Каждого Элемента Из ВыбранноеЗначение Цикл
		
		//СтруктураОтбора = Новый Структура;
		//СтруктураОтбора.Вставить("Программа", Элемент.ВыбранноеЗначение);
		//
		//НайденныеСтроки = Объект.Программы.НайтиСтроки(СтруктураОтбора);
		//
		//Если НайденныеСтроки.Количество() = 0 Тогда
			
			Строка = Объект.Программы.Добавить();
			Строка.Программа = ВыбранноеЗначение; 
			
		//КонецЕсли;
	//КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Событие(Команда)
	
	ЗначениеОтбора = Новый Структура("Контрагент", Объект.Ссылка);
	ПараметрыФормы = Новый Структура("Отбор", ЗначениеОтбора);
	ОткрытьФорму("Документ.Событие.ФормаСписка",ПараметрыФормы,, Объект.Ссылка);
	
КонецПроцедуры



