
&НаКлиенте
Процедура Сгенерировать(Команда)
	
  ГСЧ = Новый ГенераторСлучайныхЧисел;
  СимволИНН = "0123456789";
  КоличествоСимволов = СтрДлина(СимволИНН);
  
  ИНН = "";
  Для Счетчик = 1 По 10 Цикл
	         
	  ИНН = ИНН + Сред(СимволИНН, ГСЧ.СлучайноеЧисло(1, КоличествоСимволов), 1);
	  
  КонецЦикла;   
  
	  КонтрольнаяСумма = 0;

		Для Счетчик = 1 По 9 Цикл

			Если 	 Счетчик = 1 Тогда
				Множитель = 2;
			ИначеЕсли Счетчик = 2 Тогда
				Множитель = 4;
			ИначеЕсли Счетчик = 3 Тогда
				Множитель = 10;
			ИначеЕсли Счетчик = 4 Тогда
				Множитель = 3;
			ИначеЕсли Счетчик = 5 Тогда
				Множитель = 5;
			ИначеЕсли Счетчик = 6 Тогда
				Множитель = 9;
			ИначеЕсли Счетчик = 7 Тогда
				Множитель = 4;
			ИначеЕсли Счетчик = 8 Тогда
				Множитель = 6;
			ИначеЕсли Счетчик = 9 Тогда
				Множитель = 8;
			КонецЕсли; 
			
			Цифра = Число(Сред(ИНН,Счетчик,1));
			КонтрольнаяСумма = КонтрольнаяСумма + Цифра * Множитель;
			
		КонецЦикла; 
		
		КонтрольныйРазряд = (КонтрольнаяСумма %11) %10;
		
		Если КонтрольныйРазряд <> Число(Сред(ИНН,10,1)) Тогда
			
  		 Сообщить(ИНН);   
			
		КонецЕсли;
	
КонецПроцедуры
