	  
Процедура Приветствие() Экспорт 
		
	ДатаСегодня = ТекущаяДата();
	НачалоТекущегоДня = НачалоДня(ДатаСегодня);
	Сдвиг = 9 * 60 * 60;
	НачалоРабочегоДня = НачалоТекущегоДня + Сдвиг;
	МинутСНачала = Цел((ДатаСегодня - НачалоРабочегоДня) / 60);
	Если МинутСНачала < 0 Тогда
		 МинутСНачала = 0
	Конецесли;
	ОтформатированнаяДата = Формат (НачалоРабочегоДня,"ДФ=dd.MM.yy");
	ТекстСообщения = СтрШаблон ("Сегодня %1 (минут с начала рабочего дня :%2)",ОтформатированнаяДата, МинутСНачала);  
	Сообщить(ТекстСообщения); 
	
КонецПроцедуры