
Процедура ЗаполнитьПредопределенныеЭлементы() Экспорт
	
	Выборка = Справочники.ВидыКонтактнойИнформации.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ТипОбъект = Выборка.ПолучитьОбъект();
		
		Если ТипОбъект.Тип = ТелефонКонтрагента.Тип Тогда
			Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
		ИначеЕсли ТипОбъект.Тип = EMailКонтрагента.Тип Тогда
			Тип = Перечисления.ТипыКонтактнойИнформации.EMail;
		Иначе 
			Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
		КонецЕсли;
		
		ТипОбъект.Записать();
		
	КонецЦикла;
	
КонецПроцедуры
