
&НаКлиенте
Процедура Подсчитать(Команда)
	
	РабочихДней = 0;
	ВыходныхДней = 0;
	ДеньМесяца = ДатаНачала;
	
	Пока ДеньМесяца <= ДатаКонец Цикл 
		
		Если ДеньНедели(ДеньМесяца) < 6 Тогда
			РабочихДней = РабочихДней + 1;
		 	
		ИначеЕсли ДеньНедели(ДеньМесяца) < 8 Тогда
			 ВыходныхДней = ВыходныхДней + 1;
		КонецЕсли; 
		
		ДеньМесяца = ДеньМесяца + 86400;
	
	КонецЦикла;
	
	Сообщить(СтрШаблон("Рабочих дней %1, выходных дней %2", РабочихДней, ВыходныхДней))
	
	
КонецПроцедуры
