
&НаКлиенте
Процедура Сохранить(Команда)
	
	Приглашение = Объект.Имя + Объект.ЧтоЕст + Объект.ЧтоПьёт + Объект.БудетСНочёвкой;
	
	Если Объект.БудетСНочёвкой = Истина Тогда
		Ночёвка = ("Нужна кровать")
	Иначе                                          
		Ночёвка = ("Кровать не нужна");
	КонецЕсли;
	
	Если ПроверитьЗаполнение() Тогда
		Приглашение = Объект.Имя + Объект.ЧтоЕст + Объект.ЧтоПьёт + Объект.БудетСНочёвкой; 
		Сообщить(СтрШаблон("Придет: %1 Будет есть: %2 Будет пить: %3", Объект.Имя, Объект.ЧтоЕст, Объект.ЧтоПьёт));
		Сообщить(Ночёвка);
	КонецЕсли; 
			
КонецПроцедуры
