
Процедура УстановитьОтборВСписке(СписокДляОтбора, ИмяПолеДляОтбора, ЗначениеДляОтбора) Экспорт

	ПолеРодитель = Новый ПолеКомпоновкиДанных(ИмяПолеДляОтбора);
	
	НайденныйОтбор = Неопределено;
	Для Каждого Элемент Из СписокДляОтбора.Отбор.Элементы Цикл
		Если Элемент.ЛевоеЗначение = ПолеРодитель Тогда
			НайденныйОтбор = Элемент;
		КонецЕсли;
	КонецЦикла;
	
	Если НайденныйОтбор = Неопределено Тогда
		НайденныйОтбор = СписокДляОтбора.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НайденныйОтбор.ЛевоеЗначение = ПолеРодитель;
	КонецЕсли;
	
	НайденныйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	НайденныйОтбор.Использование = Истина;
	НайденныйОтбор.ПравоеЗначение = ЗначениеДляОтбора;
	
КонецПроцедуры