	  
Процедура Поздравления() Экспорт 
			
	ПраздничныеДаты = Новый Массив; 
	
	Праздник = ПраздничныеДаты;
	
	Праздник = Новый Структура("День, Месяц, Название");
	Праздник.День = 6;
	Праздник.Месяц = 3;
	Праздник.Название = "День зубного врача";
	ПраздничныеДаты.Добавить(Праздник);
	
	Праздник = Новый Структура("День, Месяц, Название");
	Праздник.День = 8;
	Праздник.Месяц = 3;
	Праздник.Название = "Женский день";
	ПраздничныеДаты.Добавить(Праздник);
	
	Праздник = Новый Структура("День, Месяц, Название");
	Праздник.День = 1;
	Праздник.Месяц = 4;
	Праздник.Название = "День смеха";
	ПраздничныеДаты.Добавить(Праздник);
	
	
	ДеньЗавтра = Дата(Год(ТекущаяДата()), Месяц(ТекущаяДата()), День(ТекущаяДата())) + 86400;
	
	
	Для Каждого Сч Из ПраздничныеДаты Цикл 
				
		Если  День(ТекущаяДата()) = Сч.День И Месяц(ТекущаяДата()) = Сч.Месяц Тогда 
			Сообщить(СтрШаблон("Поздравляем с праздником:%1", Сч.Название));
		ИначеЕсли День(ДеньЗавтра) = Сч.День И Месяц(ДеньЗавтра) = Сч.Месяц Тогда
			 Сообщить(СтрШаблон("Поздравляем с наступающим завтра праздником:%1", Сч.Название));

		КонецЕсли;     
		
	
	КонецЦикла;
	
			
КонецПроцедуры