
&НаКлиенте
Процедура Сравнить(Команда) 
	
	ДопСтрокаФормы1 = СтрЗаменить(СтрокаФормы," ","");
	ДопСтрокаДляСравнения1 = СтрЗаменить(СтрокаДляСравнения," ","");
	ДопСтрокаФормы2 = ВРег(ДопСтрокаФормы1);
	ДопСтрокаДляСравнения2 = ВРег(ДопСтрокаДляСравнения1);
	ДопСтрокаФормы3 = СокрЛП(ДопСтрокаФормы2 );
	ДопСтрокаДляСравнения3 = СокрЛП(ДопСтрокаДляСравнения2); 
	СравнениеИзмениниеСтрок = (ДопСтрокаФормы3 = ДопСтрокаДляСравнения3);
	ОтформатированноеСравнениеИзмененных = Формат (СравнениеИзмениниеСтрок,"БЛ='Не равны'; БИ=Равны");
	Сообщить(ОтформатированноеСравнениеИзмененных);
		
КонецПроцедуры
