
&НаКлиенте
Процедура ПоказатьРекомендацию(Команда)
	
	ОстатьсяДома = (Температура >30 или Температура <-30 или ШтормовоеПредупреждение) И Не ОбязательноБытьВОфисе;
	
	Если ОстатьсяДома Тогда 
		Сообщить ("Оставайтесь дома");
	ИначеЕсли Температура <-10 Тогда 
		Сообщить ("Наденьте зимнюю верхнюю одежду");
	ИначеЕсли Температура >-10 и Температура <15 Тогда 
		Сообщить ("Наденьте демисезонную верхнюю одежду");
	ИначеЕсли Температура >15 Тогда 
		Сообщить ("Наденьте летнюю верхнюю одежду");
		КонецЕсли;
	
		Если Не ОстатьсяДома И (Снег Или Гололёд) Тогда 
			Сообщить ("Добирайтесь общественным транспортом");
		КонецЕсли;

		Если Дождь И Не ОстатьсяДома Тогда 
			Сообщить ("Возьмите зонтик") 
		КонецЕсли;

	
КонецПроцедуры
